FunSoftApuntes/3Abril.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>3Abril</title>
<!-- 2018-04-04 Wed 02:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="F00l" />
</head>
<body>
<div id="content">
<h1 class="title">3Abril</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Resumen</a>
<ul>
<li><a href="#sec-1-1">1.1. Senyales</a></li>
<li><a href="#sec-1-2">1.2. Manejo del tiempo</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Alarm</a></li>
<li><a href="#sec-1-2-2">1.2.2. Temporizadores</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Maquinas de estado</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Resumen</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Senyales</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-C">signal(int signo, manejador);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Manejo del tiempo</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Alarm</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Programa un temporizador. Si anyadimos un pause() esperara
una senyal. La senyal que manda alarm es SIGALRM al terminar.
A continuacion se muestra un pequenyo ejemplo de un temporizador
periodico.
</p>
<div class="org-src-container">

<pre class="src src-C">void manejador(int signal){
    alarm(5);
    signal(SIGALRM, manejador);
}
int main(){
    signal(SIGALRM, manejador);
    alarm(5);
    while(1){
	pause();
    }
}
</pre>
</div>

<p>
Este ejemplo presenta el inconveniente de que hay un delay en el
tiempo de ejecucion, por lo que vamos a ir acumulando error.
</p>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Temporizadores</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">

<pre class="src src-C">int setitimer(int tipo, const struct itimerval *value, struct itimerval *anterior);
</pre>
</div>
<p>
Devuelve:
</p>
<ul class="org-ul">
<li>-1 cuando peta.
</li>
<li>0 cuando ejecuta OK.
</li>
</ul>


<p>
Parametros:
</p>
<ul class="org-ul">
<li>ITIMER<sub>REAL</sub>: Dispara SIGALRM.
</li>

<li>ITIMER<sub>VIRTUAL</sub>: Tiempo que esta el proceso en ejecucion,
solo con codigo del usuario. Es decir, el tiempo que tarda
en hacer llamadas al sistema no cuenta. Dispara SIGVALARM.
</li>

<li>ITIMER<sub>PROF</sub>: Tiempo que el proceso se esta ejecutando 
(usuario + kernel). Dispara SIGPROF.
</li>
</ul>

<p>
-Treal &gt; Tprof &gt; Tvirtual 
</p>

<div class="org-src-container">

<pre class="src src-C">struct itimerval{
    struct timerval it_value; // Cuando se produce el primer disparo
    struct timerval it_interval; // Cuando se produce el siguiente
}


struct timeval{
    long tv_sec;  // Segundos
    long tv_usec; // Microsegundos - S/1,000,000
}
</pre>
</div>

<p>
El temporizador se desactiva cuando se arma con el valor 0.
El kernel revisa eventos cada 10ms, aunque esto es ajustable.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Maquinas de estado</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Se usan para gestionar los estados de los protocolos.
</p>
<ul class="org-ul">
<li>Existen 2 implementaciones tipicas:
<ul class="org-ul">
<li>switch / case anidados // La que usaremos normalmente
</li>
<li>tabla de punteros a funciones // Implementacion mas dificil
</li>
</ul>
</li>
</ul>
</div>

<ol class="org-ol"><li><a id="sec-1-3-0-1" name="sec-1-3-0-1"></a>Ejemplo<br  /><div class="outline-text-5" id="text-1-3-0-1">
<div class="org-src-container">

<pre class="src src-C">#define E1 0 // 1er evento
#define E2 1 // 2do evento
.
.
.
#define EN N-1 // N evento

#define EV0 0 // 1er evento
#define EV1 1 // 2do evento

estado = Estado_inicial;

while(1){
    evento = espera_evento();
    switch(estado){
	case E1:
	    switch(evento){
		case EV1:
		    estado = E2;
		    break;
		case EV2:
		    estado = E1;
		    break;
	    }
	}
	case E2:
	    switch(evento){
		case EV1:
		    break;
		case EV2:
		    estado = E1;
		    break;
	    }
}
</pre>
</div>
</div>
</li></ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: F00l</p>
<p class="date">Created: 2018-04-04 Wed 02:59</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
